app/views/lists/show.html.erb

        <ul class="todo-list">
          <% @list.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]