app/controllers/items_controller.rb

  def create
  	@list = List.find(params[:list_id]) # in other words, find the parent!!
  	@item = @list.items.build(item_params)  	# assoaciate item with a list
  	if @item.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "milk "], ["list_id", 3], ["created_at", "2018-03-02 14:51:52.459524"], ["updated_at", "2018-03-02 14:51:52.459524"]]

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]