app/controllers/lists_controller.rb

  def index
    @list = List.new
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def create

    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "todo1"], ["created_at", "2018-02-28 03:14:39.050377"], ["updated_at", "2018-02-28 03:14:39.050377"]]